app/views/gossips/new.html.erb


  <%= form.hidden_field :user_id, value: User.find_or_create_by(first_name: "Anonyme").id %>
---
INSERT INTO "users" ("first_name", "last_name", "email", "age", "description", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Anonyme"], ["LIMIT", 1]]