app/views/gossips/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 92], ["LIMIT", 1]]
---
    <ul class="list-group list-group-flush">
      <li class="list-group-item"><strong>Auteur:</strong> <%= link_to @gossip.user.first_name, user_path(@gossip.user) %></li>

SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 6]]
---
      <li class="list-group-item"><strong>Date de création:</strong> <%= @gossip.created_at %></li>
      <li class="list-group-item"><strong>Nombre de likes:</strong> <%= @gossip.likes.count %></li> <!-- Afficher le nombre de likes -->

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---

<% @gossip.comments.each do |comment| %>
  <div class="comment">
    <p><strong>Auteur :</strong> <%= comment.user.first_name %></p>

SELECT 1 AS one FROM "likes" WHERE "likes"."gossip_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["gossip_id", 6], ["user_id", 46], ["LIMIT", 1]]
---

<% if current_user && !@gossip.likes.exists?(user_id: current_user.id) %>