app/views/welcome/index.html.erb

        <div class="card-body">
          <% user.gossips.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14)

              <!-- Afficher le nombre de likes -->
              <span class="badge bg-info text-dark"><%= gossip.likes.count %></span>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]