app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    @comments = Comment.all

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 980190962]]
---
  def destroy
    @comment.destroy!

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_comment
      @comment = Comment.find(params[:id])