app/controllers/comments_controller.rb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
---
  def new
    @gossip = Gossip.find(params[:gossip_id])

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "De la bombe bébé"], ["user_id", 12], ["gossip_id", 21], ["created_at", "2024-05-02 08:33:25.993502"], ["updated_at", "2024-05-02 08:33:25.993502"]]
---
  def create
    @gossip = Gossip.find(params[:gossip_id])
    @comment = @gossip.comments.build(comment_params)
    @comment.user = User.anonymous_user
    if @comment.save