app/controllers/gossips_controller.rb

  def like
    gossip = Gossip.find(params[:gossip_id]) # Utiliser params[:id] pour obtenir l'ID du gossip
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def unlike
    gossip = Gossip.find(params[:gossip_id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]