app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id])

INSERT INTO "gossips" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "THP"], ["description", "C'est trop bien"], ["user_id", 11], ["created_at", "2024-05-01 15:05:11.435845"], ["updated_at", "2024-05-01 15:05:11.435845"]]
SELECT "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Anonyme"], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "gshsk"], ["description", "test potin"], ["user_id", 22], ["created_at", "2024-05-01 15:32:11.808424"], ["updated_at", "2024-05-01 15:32:11.808424"]]
---
  def create
    @gossip = Gossip.new(gossip_params)
    @gossip.user = User.find_or_create_by(first_name: "Anonyme") # Créer un utilisateur anonyme s'il n'existe pas déjà
    if @gossip.save

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:id])

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "gossips" SET "description" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["description", "Rem et quam. Sit ab qui. Aut est dolores. Ea unde consectetur. Quisquam consequatur perspiciatis"], ["updated_at", "2024-05-01 10:19:53.639241"], ["id", 15]]
---
  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.update(gossip_params)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 4]]
---
  def destroy
    @gossip = Gossip.find(params[:id])
    @gossip.destroy